<?php

namespace Database\Seeders;

use App\Models\Category;
use App\Models\Size;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Support\Str;
use Illuminate\Database\Seeder;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        for($i=1;$i<=23;$i++)
        {
            $arr[] = 'К'.$i;
        }

        $categories = [
            [
                'name' => 'Корсет',
                'sizes' => ['К1','К2','К3','К4','К5','К6','К7','К8','К9','К10','К11','К12','К13','К14','К15','К16','К17','К18','К19','К20','К21'],
            ],[
                'name' => 'Сукня(вечірня)',
                'sizes' => ['Св1','Св2','Св3','Св4','Св5','Св6','Св7','Св8','Св9','Св10','Св11','Св12','Св13','Св14','Св15','Св16','Св17','Св18','Св19','Св20','Св21','Св22','Св23','Св24','Св25','Св26','Св27','Св28'],
            ],[
                'name' => 'Сукня(коктельна)',
                'sizes' => ['Св1','Св2','Св3','Св4','Св5','Св6','Св7','Св8','Св9','Св10','Св11','Св12','Св13','Св14','Св15','Св16','Св17','Св18','Св19','Св20','Св21','Св22','Св23','Св24','Св25','Св26','Св27','Св28'],
            ],[
                'name' => 'Штани',
                'sizes' => ['Ш1','Ш2','Ш3','Ш4','Ш5','Ш6','Ш7','Ш8','Ш9','Ш10','Ш11'],
            ],[
                'name' => 'Жакет',
                'sizes' => ['Ж1','Ж2','Ж3','Ж4','Ж5','Ж6','Ж7','Ж8','Ж9','Ж10','Ж11','Ж12','Ж13','Ж14','Ж15','Ж16','Ж17','Ж18','Ж19','Ж20','Ж21','Ж22','Ж23','Ж24'],
            ],[
                'name' => 'Боді',
                'sizes' => ['Б1','Б2','Б3','Б4','Б5','Б6','Б7','Б8','Б9','Б10','Б11','Б12','Б13','Б14','Б15','Б16','Б17','Б18','Б19','Б20','Б21','Б22','Б23','Б24','Б25','Б26','Б27','Б28'],
            ],[
                'name' => 'Білизна',
                'sizes' => ['К1','К2','К3','К4','К5','К6','К7','К8','К9','К10','К11','К12','К13','К14','К15','К16','К17','К18','К19','К20','К21','К22','К23'],
            ],
        ];

        foreach($categories as $category){
            $newCategory = Category::firstOrCreate([
                'slug' => Str::slug($category['name']),
            ],[
                'name' => $category['name'],
            ]);

            if($newCategory->wasRecentlyCreated){
                $sizes = Size::whereIn('code',$category['sizes'])->pluck('id');
                $newCategory->sizes()->sync($sizes);
            }

        }
    }
}
