<?php

namespace Database\Seeders;

use App\Models\Size;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Support\Str;
use Illuminate\Database\Seeder;

class SizeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $sizes = [
            [
                'code' => 'К1' ,
                'name' => 'Нижній радіус HR (від вищої точки грудних залоз вниз)',
            ],[
                'code' => 'К2' ,
                'name' => 'Верхній радіус HR (від вищої точки грудних залоз верх)',
            ],[
                'code' => 'К3' ,
                'name' => 'Проекція горизонтальної дуги (під грудьми вимірюється) можна виміряти ширину каркасу в бюстгалтері, ПГД',
            ],[
                'code' => 'К4' ,
                'name' => 'Горизонтальна дуга, ГД = CR+ БR(через вищу точку грудних залоз)',
            ],[
                'code' => 'К5' ,
                'name' => 'Маса грудей, mr',
            ],[
                'code' => 'К6' ,
                'name' => 'Середній радіус (від центру грудини до вищої точки грудей), CR',
            ],[
                'code' => 'К7' ,
                'name' => 'К7 Бічний радіус, БR (від боку до вищої точки грудей)',
            ],[
                'code' => 'К8' ,
                'name' => 'Висота тулуба (середина), Вт(с)',
            ],[
                'code' => 'К9' ,
                'name' => 'Висота від талії до грудей, Втг',
            ],[
                'code' => 'К10' ,
                'name' => 'Висота від талії до лінії обхвату стегон, Втс',
            ],[
                'code' => 'К11' ,
                'name' => 'Висота бочка нижня, Вбн',
            ],[
                'code' => 'К12' ,
                'name' => 'Висота від талії до лінії верхнього обхвату стегон (лінія трусиків), Втвс',
            ],[
                'code' => 'К13' ,
                'name' => 'Поперек до лобкової кістки (сидячи) Плк',
            ],[
                'code' => 'К14' ,
                'name' => 'Ширина грудей перша, Шг1',
            ],[
                'code' => 'К15' ,
                'name' => 'Обхват стегон верхній, Осв',
            ],[
                'code' => 'К16' ,
                'name' => 'Ширина спини, Шс',
            ],[
                'code' => 'К17' ,
                'name' => 'Обхват стегон, Ос',
            ],[
                'code' => 'К18' ,
                'name' => 'Центр грудей, Цг',
            ],[
                'code' => 'К19' ,
                'name' => 'Обхват талії, От',
            ],[
                'code' => 'К20' ,
                'name' => 'Ширина грудей друга, Шг2',
            ],[
                'code' => 'К21' ,
                'name' => 'Обхват грудей четвертий, Ог4',
            ],[
                'code' => 'К22' ,
                'name' => 'Довжина сідла, Дсід',
            ],[
                'code' => 'К23' ,
                'name' => 'Висота сидіння, Вс',
            ],[
                'code'=> 'Б1',
                'name'=>'Обхват шиї, Ош',
            ],[
                'code'=> 'Б2',
                'name' =>'Глибина декольте, Гдек',
            ],[
                'code'=> 'Б3',
                'name' =>'Довжина корпусу. Дк',
            ],[
                'code'=> 'Б4',
                'name' =>'Висота бочка верхня. Вбв',
            ],[
                'code'=> 'Б5',
                'name' =>'Довжина руки до зап\'ястя, Дзап',
            ],[
                'code'=> 'Б6',
                'name' =>'Обхват ліктя, Олік',
            ],[
                'code'=> 'Б7',
                'name' =>'Обхват зап\'ястя, Озап',
            ],[
                'code'=> 'Б8',
                'name' =>'Обхват плечей. Оплеч',
            ],[
                'code'=> 'Б9',
                'name' =>'Довжина руки до ліктя. Дрл',
            ],[
                'code'=> 'Б10',
                'name' => 'Ширина грудей друга, ШГ2',
            ],[
                'code'=> 'Б11',
                'name' => 'Ширина плеча. Шп',
            ],[
                'code'=> 'Б12',
                'name' => 'Висота бочка нижня, Вбн',
            ],[
                'code'=> 'Б13',
                'name' => 'Довжина сідла, Дсід',
            ],[
                'code'=> 'Б14',
                'name' => 'Обхват талії. От',
            ],[
                'code'=> 'Б15',
                'name' => 'Обхват плеча. Оп',
            ],[
                'code'=> 'Б16',
                'name' => 'Висота від талії до лінії верхнього обхвату стегон (лінія трусиків). Втвс',
            ],[
                'code'=> 'Б17',
                'name' => 'Поперек до побкової кістки (сидячи) Плк',
            ],[
                'code'=> 'Б18',
                'name' => 'Висота грудей, Вг',
            ],[
                'code'=> 'Б19',
                'name' => 'Обхват стегон, Ос',
            ],[
                'code'=> 'Б20',
                'name' => 'Обхват грудей третій. Ог3',
            ],[
                'code'=> 'Б21',
                'name' => 'Обхват грудей четвертий. Ог4',
            ],[
                'code'=> 'Б22',
                'name' => 'Обхват стегон, Ос',
            ],[
                'code'=> 'Б23',
                'name' => 'Обхват стегон нижній, Осн',
            ],[
                'code'=> 'Б24',
                'name' => 'Висота сидіння, Вс',
            ],[
                'code'=> 'Б25',
                'name' => 'Ширина плечей по спині, Шпс',
            ],[
                'code'=> 'Б26',
                'name' => 'Довжина спинки до талії, Дтс',
            ],[
                'code'=> 'Б27',
                'name' => 'Висота плеча коса спини, Впкс',
            ],[
                'code'=> 'Б28',
                'name' => 'Ширина спини. Шc',
            ],[
                'code' => 'Ж1',
                'name' => 'Обхват шиї, Ош',
            ],[
                'code' => 'Ж2',
                'name' => 'Обхват плечей, Оплеч',
            ],[
                'code' => 'Ж3',
                'name' => 'Ширина грудей перша, Шг1',
            ],[
                'code' => 'Ж4',
                'name' => 'Довжина переду до талії. Дтп',
            ],[
                'code' => 'Ж5',
                'name' => 'Довжина руки до зап\'ястя, Дзап',
            ],[
                'code' => 'Ж6',
                'name' => 'Висота бочка верхня. Вбвр',
            ],[
                'code' => 'Ж7',
                'name' => 'Висота бочка нижня, Вбн',
            ],[
                'code' => 'Ж8',
                'name' => 'Обхват зап\'ястя, Озап',
            ],[
                'code' => 'Ж9',
                'name' => 'Ширина плеча, Шп',
            ],[
                'code' => 'Ж10',
                'name' => 'Обхват грудей перший, Ог1',
            ],[
                'code' => 'Ж11',
                'name' => 'Обхват плеча. Оп',
            ],[
                'code' => 'Ж12',
                'name' => 'Обхват талії, От',
            ],[
                'code' => 'Ж13',
                'name' => 'Обхват стегон верхній, Осв',
            ],[
                'code' => 'Ж14',
                'name' => 'Обхват стегон, Ос',
            ],[
                'code' => 'Ж15',
                'name' => 'Обхват грудей третій, Ог3',
            ],[
                'code' => 'Ж16',
                'name' => 'Довжина жакета, Дж',
            ],[
                'code' => 'Ж17',
                'name' => 'Довжина руки до ліктя, Дрл',
            ],[
                'code' => 'Ж18',
                'name' => 'Обхват ліктя, Олік',
            ],[
                'code' => 'Ж19',
                'name' => 'Висота пройми ззаду, Впрз',
            ],[
                'code' => 'Ж20',
                'name' => 'Зріст',
            ],[
                'code' => 'Ж21',
                'name' => 'Довжина спинки до талії, Дтс',
            ],[
                'code' => 'Ж22',
                'name' => 'Ширина спини, Ше',
            ],[
                'code' => 'Ж23',
                'name' => 'Ширина плечей по спині, Шпс',
            ],[
                'code' => 'Ж24',
                'name' => 'Висота плеча коса спини. Впкс',
            ],[
                'code' => 'Ж24',
                'name' => 'Висота плеча коса спини. Впкс',
            ],[
                'code' => 'Св1',
                'name' => 'Обхват грудей перший, Ог1',
            ],[
                'code' => 'Св2',
                'name' => 'Обхват грудей третій, Ог3',
            ],[
                'code' => 'Св3',
                'name' => 'Обхват грудей четвертий, Ог4',
            ],[
                'code' => 'Св4',
                'name' => 'Обхват талії, От',
            ],[
                'code' => 'Св5',
                'name' => 'Обхват стегон верхній, Осв',
            ],[
                'code' => 'Св6',
                'name' => 'Обхват стегон нижній, Осн',
            ],[
                'code' => 'Св7',
                'name' => 'Обхват стегон, Ос',
            ],[
                'code' => 'Св8',
                'name' => 'Ширина грудей перша, Шп',
            ],[
                'code' => 'Св9',
                'name' => 'Ширина грудей друга, Ш2',
            ],[
                'code' => 'Св10',
                'name' => 'Глибина декольте, Гдек',
            ],[
                'code' => 'Св11',
                'name' => 'Довжина руки до ліктя, Дрл',
            ],[
                'code' => 'Св12',
                'name' => 'Висота грудей, Вг',
            ],[
                'code' => 'Св13',
                'name' => 'Обхват стегон нижній, Осн',
            ],[
                'code' => 'Св14',
                'name' => 'Ширина плеча, Шп',
            ],[
                'code' => 'Св15',
                'name' => 'Довжина руки до зап\'ястя, Дзап',
            ],[
                'code' => 'Св16',
                'name' => 'Обхват плеча, Оп',
            ],[
                'code' => 'Св17',
                'name' => 'Обхват ліктя, Олік',
            ],[
                'code' => 'Св18',
                'name' => 'Обхват зап\'ястя, Озап',
            ],[
                'code' => 'Св19',
                'name' => 'Висота бочка верхня, Вбв',
            ],[
                'code' => 'Св20',
                'name' => 'Висота бочка нижня, Вбн',
            ],[
                'code' => 'Св21',
                'name' => 'Ширина плечей по спині, Шпс',
            ],[
                'code' => 'Св22',
                'name' => 'Довжина спинки до талії, Дтс',
            ],[
                'code' => 'Св23',
                'name' => 'Ширина спини, Шс',
            ],[
                'code' => 'Св24',
                'name' => 'Висота плеча коса спини, Впкс',
            ],[
                'code' => 'Св25',
                'name' => 'Довжина спідниці збоку (коротка), Дсб(к)',
            ],[
                'code' => 'Св26',
                'name' => 'Довжина спідниці збоку, Дсб+каб (довга, з підборами)',
            ],[
                'code' => 'Св27',
                'name' => 'Висота каблука, Вкаб',
            ],[
                'code' => 'Св28',
                'name' => 'Зріст',
            ],[
                'code' => 'Ш1',
                'name' => 'Обхват талії, От',
            ],[
                'code' => 'Ш2',
                'name' => 'Обхват стегон верхній, Осв',
            ],[
                'code' => 'Ш3',
                'name' => 'Обхват стегон нижній, Осн',
            ],[
                'code' => 'Ш4',
                'name' => 'Довжина спідниці збоку (довга) Дсб',
            ],[
                'code' => 'Ш5',
                'name' => 'Обхват стегон, Ос',
            ],[
                'code' => 'Ш6',
                'name' => 'Довжина ноги до коліна, Днк',
            ],[
                'code' => 'Ш7',
                'name' => 'Обхват щиколодки, Ощ',
            ],[
                'code' => 'Ш8',
                'name' => 'Зріст',
            ],[
                'code' => 'Ш9',
                'name' => 'Висота каблука, Вкаб',
            ],[
                'code' => 'Ш10',
                'name' => 'Обхват стегна, Ост',
            ],[
                'code' => 'Ш11',
                'name' => 'Обхват коліна, Ок',
            ],
        ];
        foreach($sizes as $size){
            Size::firstOrCreate([
                'key' => Str::slug($size['code']),
            ],[
                'code' => $size['code'],
                'name' => $size['name'],
            ]);
        }
    }
}
